{
  "loginTitle": "Log in",
  "signupTitle": "Sign up",
  "notHaveAccount": "Don't have an account yet? ",
  "createAccount": "Create account",
  "login": "Sign in",
  "signUpGoogle": "Sign up with Google",
  "signUpFacebook": "Sign up with Facebook",
  "signGoogle": "Sign in with Google",
  "signFacebook": "Sign in with Facebook",
  "forgotPassword": "Forgot your password?",
  "confirmPassword": "Confirm Password",
  "remember": "Remember me",
  "selectSpace": "Select a Workspace",
  "multiSpace": "You are participating in more than one workspace. Please select one of them for authentication",
  "errors": {
    "notVerifiedTitle": "Not verified.",
    "notVerified": "Your user has not been verified. Please check your email to confirm your login details. account.",
    "badCredentials": "You entered an incorrect username or password.",
    "lockAccount": "Your account has been locked or deleted. Please contact an administrator",
    "duplicatedUser": "The email address you entered is already in use. Already have an account? Try resetting your password",
    "duplicatedCI": "The ID you entered is already in use. Already have an account? Try resetting your password",
    "passwordHistory": "You have already used this password before. Please try a new one"
  },
  "signUpTitle": "Create your account",
  "signup": "Create account",
  "haveAccount": "Already have an account? ",
  "havePassword": "Already have a password? ",
  "acceptTerms": "I agree to the <terms><small>terms and conditions</small></terms>",
  "termsConditions": "Terms and conditions",
  "forgetPasswordTitle": "Recover password",
  "newPasswordTitle": "New password",
  "forgetPasswordDescription": "Please enter an email where we can send you a link with instructions to reset your password.",
  "resetPassword": "Recover",
  "successSignUp": "<alert>You have been successfully registered</alert>We have sent an email with verification instructions to <bold>{{email}}</bold>. Please check your email and follow the instructions.<brake></brake> If you have not received an email from us within 15 minutes, please check your SPAM folder. If there is still no email, click here to resend it.",
  "confirmation": {
    "title": "Verification",
    "loading": "Verifying your account...",
    "successTitle": "Account successfully verified",
    "errorCheckTitle": "Link expired",
    "errorCheckSubtext": "This can happen if you clicked on the link we sent you after successfully logging into your account, the link has expired, or the URL is incorrect.",
    "errorUserNotFountOrVerified": "User does not exist or is already verified",
    "newLink": "Please enter the email address you registered with, a new verification link will be provided",
    "resend": "Send",
    "emailResend": "Another email has been sent with instructions",
    "emailResendAction": "Resend email for verification"
  },
  "newLink": "Send new link",
  "resetPasswordLoading": "Verifying...",
  "resend": "Resend",
  "recovery": {
    "helpText": "Please enter an email address where we can send you a link with instructions to reset your password.",
    "newPasswordHelpText": "Please enter a password that is difficult to guess and contains at least 6 characters. Do not use one of your last passwords.",
    "sentSubtext": "If <bold>{{email}}</bold> is associated with an existing account, you will receive an email with instructions to reset your password.<brake></brake> If you have not received an email from us within 15 minutes, please check your <bold>SPAM</bold> folder. If there is still no email, click here to try again.",
    "errorCheckTitle": "Invalid Link",
    "errorCheckSubtext": "This can happen if you opened a link that you already used to successfully change your password, the link has expired, or the URL is incorrect.",
    "passwordChanged": "Your password has been successfully updated."
  }
}